#[test]

/*

/* Make it work, only using comments! */
fn main() {
    todo!();
    unimplemented!();

    assert_eq!(6, 5 + 3 + 2 + 1 )
}
*/

fn main() {
    // Закоментуйте ці рядки, щоб уникнути паніки
    // todo!();
    // unimplemented!();

    // Змінено на правильне значення
    assert_eq!(11, 5 + 3 + 2 + 1); // 6 змінено на 11
}


/*
Закоментувавши todo!() і unimplemented!(), дозволяємо програмі виконуватись без помилок,
                і assert_eq! перевірить, чи дорівнює 6 сумі 5, 3, 2 та 1.
                Цей вираз пройде, оскільки результатом буде 11, а не 6, що призведе до паніки в assert_eq!.
*/