

/*/// # Panics
///
/// Функція викликає паніку, якщо другий аргумент дорівнює нулю.
///
/// ```rust,should_panic
/// // паніка при діленні на нуль
/// doc_comments::compute::div(10, 0);
/// ```
pub fn div(a: i32, b: i32) -> i32 {
    if b == 0 {
        panic!("Divide-by-zero error");
    }

    a / b
}*/

/*
Коментар /// # Panics: Це заголовок для секції документації, який пояснює, коли може статися паніка.
Опис: Надає короткий опис того, що функція панікує, якщо другий аргумент дорівнює нулю.
Приклад: Використовує директиву rust,should_panic, щоб вказати, що цей тест повинен завершитися з панікою.
Запуск тестів
Після внесення змін збережіть файл і запустіть тестування документації, використовуючи команду:

cargo test --doc
*/