

/*#[doc(hidden)]
/// ```
/// # fn try_main() -> Result<(), String> {
/// # let res = doc_comments::compute::try_div(10, 0)?;
/// # Ok(()) // returning from try_main
/// # }
/// # fn main() {
/// #    try_main().unwrap();
/// # }
/// ```
pub fn try_div(a: i32, b: i32) -> Result<i32, String> {
    if b == 0 {
        Err(String::from("Divide-by-zero"))
    } else {
        Ok(a / b)
    }
}*/

/*
Щоб приховати коментарі документації, але залишити можливість використовувати тести документації,
можно скористатися модифікатором #[doc(hidden)]

#[doc(hidden)]: Ця атрибуція перед коментарем вказує на те, що коментар не повинен відображатися в документації. Проте, приклад у коментарі все ще буде виконуватися під час тестування документації.

Приклад: У коментарі залишився код, що демонструє, як викликати try_div, навіть якщо сам коментар не відображатиметься у згенерованій документації.

cargo test --doc Це перевірить, що код працює коректно, навіть якщо коментарі не відображаються в документації.

*/